'''
print(...)
    print(value, ..., sep=' ', end='\n', file=sys.stdout, flush=False)
%s  字符串采用str()的显示                                 %x     十六进制整数

%r  字符串(repr())的显示                                 %e     指数（基底写e）

%c  单个字符                                     %E   指数（基底写E）

%b 二进制整数                                      %f,%F 浮点数

%d 十进制整数                                      %g   指数(e)或浮点数(根据显示长度)

%i  十进制整数                                    %G     指数(E)或浮点数(根据显示长度)

%o 八进制整数                                     %%    字符%
---------------------
'''
import math
PI=math.pi
print('%10.3f' % PI)  # 字段宽10，精度3
#     3.142

# 精度为3，所以只显示142，指定宽度为10，所以在左边需要补充5个空格，以达到10位的宽度
PI = 3.1415926
print("PI=%.*f" % (3, PI))
# 用*从后面的元组中读取字段宽度或精度,可以读取出来精度是3位
# PI=3.142

# 没有指定宽度，所以不需要缩进

print("PI=%*.3f" % (10, PI))  # 精度为3，总长为10.
# PI=     3.142

# * 所处的位置不同，读取的内容也不同
print('%-10.3f' %PI)  #左对齐，还是10个字符，但空格显示在右边。
#3.142
print('%010.3f'%PI) #字段宽度为10，精度为3，不足处用0填充空白
#000003.142   0表示转换值若位数不够则用0填充
for x in range(0, 5):
    print(x)

'''
0
1
2
3
4
'''
for x in range(0, 5):
    print(x, end=' ')
#0 1 2 3 4
print('\n\n')
for x in range(0, 5):
    print(x, end=',')

'''
0 1 2 3 4 
0,1,2,3,4,
'''